# Q1: Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data.
# This task will be done in following steps:
# 1. First get the webpage https://www.shine.com/
# 2. Enter “Data Analyst” in “Job title, Skills” field and enter “Bangalore” in “enter the location” field.
# 3. Then click the searchbutton.
# 4. Then scrape the data for the first 10 jobs results you get.
# 5. Finally create a dataframe of the scraped data.
# Note: All of the above steps have to be done in code. No step is to be done manually.

In [22]:
!pip install selenium

Requirement already satisfied: selenium in c:\users\anand\anaconda3\lib\site-packages (4.17.2)
Requirement already satisfied: urllib3[socks]<3,>=1.26 in c:\users\anand\anaconda3\lib\site-packages (from selenium) (1.26.16)
Requirement already satisfied: trio~=0.17 in c:\users\anand\anaconda3\lib\site-packages (from selenium) (0.24.0)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\anand\anaconda3\lib\site-packages (from selenium) (0.11.1)
Requirement already satisfied: certifi>=2021.10.8 in c:\users\anand\anaconda3\lib\site-packages (from selenium) (2023.7.22)
Requirement already satisfied: typing_extensions>=4.9.0 in c:\users\anand\anaconda3\lib\site-packages (from selenium) (4.9.0)
Requirement already satisfied: attrs>=20.1.0 in c:\users\anand\anaconda3\lib\site-packages (from trio~=0.17->selenium) (22.1.0)
Requirement already satisfied: sortedcontainers in c:\users\anand\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: idna in c:\users\anand\anaconda3\lib\site-packages (from trio~=0.17->selenium) (3.4)
Requirement already satisfied: outcome in c:\users\anand\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.3.0.post0)
Requirement already satisfied: sniffio>=1.3.0 in c:\users\anand\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.3.0)
Requirement already satisfied: cffi>=1.14 in c:\users\anand\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.15.1)
Requirement already satisfied: wsproto>=0.14 in c:\users\anand\anaconda3\lib\site-packages (from trio-websocket~=0.9->selenium) (1.2.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\users\anand\anaconda3\lib\site-packages (from urllib3[socks]<3,>=1.26->selenium) (1.7.1)
Requirement already satisfied: pycparser in c:\users\anand\anaconda3\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.21)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\anand\anaconda3\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.14.0)

In [56]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [57]:
driver=webdriver.Chrome()

In [58]:
# opening the shine page on automated chrome browser
driver.get("https://www.shine.com")

In [60]:
# enter designation as required in the question
designation=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input")
designation.send_keys('Data analyst')

In [61]:
# enter location as required in the question
location=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
location.send_keys('Bangalore')

In [63]:
search=driver.find_element(By.XPATH, "/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button")
search.click()

In [74]:
job_titles=[]
job_location=[]
company_name=[]
experience_required=[]

In [75]:
title_tags=driver.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in title_tags:
    titles=i.text
    job_titles.append(titles)
location_tags=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in location_tags:
    location=i.text
    job_location.append(location)
company_tags=driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in company_tags:
    company=i.text
    company_name.append(company)
experience_tags=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')  
for i in experience_tags:
    experience=i.text
    experience_required.append(experience)

In [76]:
print(len(job_titles),len(job_location),len(company_name),len(experience_required))

40 40 40 40

In [77]:
import pandas as pd
df=pd.DataFrame({'title':job_titles,'location':job_location,'company_name':company_name,'experience':experience_required})
df

,title,location,company_name,experience
0,Lead Data Analyst,Bangalore,ara resources private limited,4 to 9 Yrs
1,Data Analyst,Bangalore\n+3,diraa hr services hiring for mncs,0 to 1 Yr
2,Vacancy For Data Analyst,Bangalore\n+14,yogita staffing solution,0 to 3 Yrs
3,Clinical Data Analyst,Bangalore\n+6,techno endura,0 to 1 Yr
4,Data Management,Bangalore\n+18,future solution centre,15 to >25 Yrs
5,Data Modeler data,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
6,Data Modeller,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
7,Data Modeler Bangalore,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
8,Data Modeler,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
9,Clinical Data Analyst,Bangalore\n+4,quiscon biotech,0 to 2 Yrs
10,Full time Opportunity-Networking Advisor-Cisco...,Bangalore\n+5,ntt data information processing ser...,10 to 20 Yrs
11,Data Engineer Ii,Bangalore\n+9,v-tech data outsourcing,0 to 1 Yr
12,Data Analyst Hiring Fresher and Experience,Bangalore\n+13,kavya interprises,0 to 4 Yrs
13,Data Analyst Hiring Fresher and Experience,Bangalore\n+13,kavya interprises,0 to 4 Yrs
14,ML Data Scientist,Bangalore\n+3,gujarat facility services hiring fo...,5 to 8 Yrs
15,Hiring for Business Analyst,Bangalore\n+15,renuka interprises,0 to 4 Yrs
16,Hiring for Business Analyst,Bangalore\n+15,renuka interprises,0 to 4 Yrs
17,Data Modeler,Bangalore\n+6,ltimindtree limited,5 to 10 Yrs
18,Data Engineer-OBIEE,Bangalore\n+1,ltimindtree limited,5 to 10 Yrs
19,Clinical Data Analyst,Bangalore\n+6,techno endura,0 to 1 Yr
20,Data Analyst,Bangalore,infosys limited,4 to 6 Yrs
21,Data typing/computer operator/work from home/p...,Bangalore,fondstaff private limited,0 to 4 Yrs
22,Data Intelligence Analyst,Bangalore\n+6,quiscon biotech,0 to 1 Yr
23,Azure Data Engineer,Bangalore\n+1,digitalcube consultancy,7 to 12 Yrs
24,Vacancy For Data Scientist Fresher and Experience,Bangalore\n+14,yogita staffing solution,0 to 3 Yrs
25,Clinical Data Analyst,Bangalore\n+6,techno endura,0 to 1 Yr
26,Assistant Vice President,Bangalore\n+8,whiteslips global services private ...,10 to 20 Yrs
27,Data Modeler Bangalore,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
28,Walkin Drive for Power Bi,Bangalore\n+1,hucon solutions india pvt.ltd.,2 to 4 Yrs
29,Lead Data Scientist,Bangalore\n+1,aereo,7 to 10 Yrs
30,Data Modeler _Bangalore,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
31,Data Engineer,Bangalore,varite india private limited,4 to 7 Yrs
32,Data Warehouse _ Manager For bangalore,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
33,Data Warehouse _Manager,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
34,Data Engineer,Bangalore\n+9,future solution centre,10 to 20 Yrs
35,Business Development Analyst,Bangalore\n+9,rianshi developers private limited,10 to 20 Yrs
36,Analytics Manager,Bangalore\n+9,vaishnavi services,15 to >25 Yrs
37,Data Scientist Urgent Vacancy,Bangalore\n+14,yogita staffing solution,0 to 3 Yrs
38,Hiring Now for a Part-Time Data Entry Operator...,Bangalore\n+9,pick bright hr solution,0 to 1 Yr
39,Software Developer Recruitment,Bangalore\n+15,renuka interprises,0 to 4 Yrs

# Q2:Write a python program to scrape data for “Data Scientist” Job position in“Bangalore” location. You have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data.
# This task will be done in following steps:
# 1. First get the webpage https://www.shine.com/
# 2. Enter “Data Scientist” in “Job title, Skills” field and enter “Bangalore” in “enter thelocation” field.
# 3. Then click the search button.
# 4. Then scrape the data for the first 10 jobs results you get.
# 5. Finally create a dataframe of the scraped data.
# Note: All of the above steps have to be done in code. No step is to be done manually.

In [79]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [83]:
driver=webdriver.Chrome()

In [85]:
# opening the shine page on automated chrome browser
driver.get("https://www.shine.com")

In [86]:
# enter designation as required in the question
designation=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input")
designation.send_keys('Data Scientist')

In [88]:
location=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
location.send_keys('Bangalore')

In [89]:
search=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button")
search.click()

In [90]:
job_titles=[]
job_location=[]

In [91]:
# scraping job title from the given page
title_tags=driver.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in title_tags:
    titles=i.text
    job_titles.append(titles)
    
# scraping job location from the given page
location_tags=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in location_tags:
    location=i.text
    job_location.append(location)

In [92]:
print(len(job_titles),len(job_location))

20 20

In [93]:
import pandas as pd
df=pd.DataFrame({'title':job_titles,'location':job_location})
df

                                                title        location
0                                   ML Data Scientist   Bangalore\n+3
1                       Data Scientist Urgent Vacancy  Bangalore\n+15
2                          Data Scientist Recruitment  Bangalore\n+15
3                          Data Scientist Recruitment  Bangalore\n+15
4                                      Data Scientist   Bangalore\n+4
5                                      Data Scientist       Bangalore
6       Lead Data Scientist/ Principal Data Scientist   Bangalore\n+1
7   Vacancy For Data Scientist Fresher and Experience  Bangalore\n+14
8                               Senior Data Scientist   Bangalore\n+1
9                                 Lead Data Scientist   Bangalore\n+1
10                                     Data Scientist   Bangalore\n+7
11                      Data Scientist Urgent Vacancy  Bangalore\n+14
12                                     Data Scientist   Bangalore\n+2
13                              Pharma Data Scientist   Bangalore\n+4
14                          Hiring For Data Scientist  Bangalore\n+13
15                          Hiring For Data Scientist  Bangalore\n+14
16                      Data Scientist Urgent Vacancy  Bangalore\n+13
17                         Data Scientist Recruitment  Bangalore\n+13
18                                     Data Scientist       Bangalore
19  Full time Opportunity-Networking Advisor-Cisco...   Bangalore\n+5

# Q3: In this question you have to scrape data using the filters available on the webpage
#  You have to use the location and salary filter.
# You have to scrape data for “Data Scientist” designation for first 10 job results.
# You have to scrape the job-title, job-location, company name, experience required.
# The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs
# The task will be done as shown in the below steps:
# 1. first get the web page https://www.shine.com/
# 2. Enter “Data Scientist” in “Skill, Designations, and Companies” field.
# 3. Then click the search button.
# 4. Then apply the location filter and salary filter by checking the respective boxes
# 5. Then scrape the data for the first 10 jobs results you get.
# 6. Finally create a dataframe of the scrapeddata.
# Note: All of the above steps have to be done in code. No step is to be done manually.

In [119]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [120]:
driver=webdriver.Chrome()

In [121]:
# opening the shine page on automated chrome browser
driver.get("https://www.shine.com")

In [122]:
# enter designation as required in the question
designation=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul[1]/li[1]/div/input")
designation.send_keys('Data Scientist')

In [123]:
location=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul[1]/li[2]/div/input")
location.send_keys('Delhi-ncr Region')

In [124]:
salary=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul[2]/li[1]/div/input[1]")
salary.send_keys('3-6 lakhs')

In [125]:
search=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button")
search.click()

In [126]:
job_titles=[]
job_location=[]
company_name=[]
experience_required=[]

In [127]:
# scraping job title from the given page
title_tags=driver.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in title_tags:
    titles=i.text
    job_titles.append(titles)
    
# scraping job location from the given page
location_tags=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in location_tags:
    location=i.text
    job_location.append(location)
# scraping company name from the given page
company_tags=driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in company_tags:
    company=i.text
    company_name.append(company)
# scarping job expreience from the given page
experience_tags=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in experience_tags:
    exp=i.text
    experience_required.append(exp)

In [128]:
print(len(job_titles),len(job_location),len(company_name),len(experience_required))

20 20 20 20

In [129]:
import pandas as pd
df=pd.DataFrame({'title':job_titles,'location':job_location,'company_name':company_name,'experience':experience_required})
df

,title,location,company_name,experience
0,Data Scientist,Gurugram\n+1,right advisors private limited,2 to 7 Yrs
1,Data Scientist,Delhi\n+4,acme services private limited,3 to 5 Yrs
2,Data Scientist,Noida\n+1,thescholarhat,1 to 3 Yrs
3,Data Scientist - Japanese language,Delhi,right advisors private limited,5 to 8 Yrs
4,DataNeuron - Senior Data Scientist - NLP,Delhi,dataneuron,3 to 4 Yrs
5,Data Scientist,Delhi,adept global,3 to 7 Yrs
6,Senior Data Scientist,Delhi,roadzen,5 to 9 Yrs
7,Python Data Scientist,Noida\n+1,buddy4study,4 to 8 Yrs
8,Data Scientist,Delhi,scrolltab,4 to 8 Yrs
9,Senior/Lead Data Scientist- Noida/Bangalore/Hy...,Noida\n+1,techneplus,3 to 8 Yrs
10,Data Scientist,Noida\n+1,info edge india ltd,1 to 5 Yrs
11,Data Scientist at WinZO,Delhi,winzone technology pvt ltd,0 to 3 Yrs
12,Data Scientist,Noida\n+1,reddoorz,2 to 7 Yrs
13,Immediate opening for Data Scientist- Delhi (H...,Delhi,htc global services,3 to 5 Yrs
14,Senior Data Scientist,Delhi,chegg india,5 to 7 Yrs
15,Data Scientist,Noida\n+1,arya.ag,2 to 6 Yrs
16,BCG X Lead Data Scientist,Delhi,boston consulting group,9 to 13 Yrs
17,Senior Data Scientist,Delhi,tcns clothing company ltd,2 to 4 Yrs
18,Data Scientist,Noida\n+1,adobe,5 to 9 Yrs
19,Data Scientist,Delhi\n+7,people staffing solutions,4 to 9 Yrs

# Q4: Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
# 6. Brand
# 7. ProductDescription
# 8. Price
# The attributes which you have to scrape is ticked marked in the below image.

# To scrape the data you have to go through following steps:
# 1. Go to Flipkart webpage by url :https://www.flipkart.com/
# 2. Enter “sunglasses” in the search fieldwhere “search for products, brands and more” is written and click the search icon
# 3. After that you will reach to the page having a lot of sunglasses. From this page you can scrap the required data as usual.
# 4. After scraping data from the first page, go to the “Next” Button at the bottom other page , then click on it.
# 5. Now scrape data from this page as usual
# 6. Repeat this until you get data for 100sunglasses.
# Note: That all of the above steps have to be done by coding only and not manually.

In [131]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [133]:
driver=webdriver.Chrome()

In [134]:
# opening the shine page on automated chrome browser
driver.get("https://www.flipkart.com/")

In [135]:
sunglass=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/div/input")
sunglass.send_keys('sunglasses')

In [137]:
search=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/button")
search.click()

In [229]:
Brand=[]
ProductDescription=[]
Price=[]

In [235]:
# scraping brand title from the given page
brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brand_tags:
    titles=i.text
    Brand.append(titles)
    
# scraping productdescription from the given page
ProductDescription_tags=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
for i in ProductDescription_tags:
    product=i.text
    ProductDescription.append(product)
    
# scraping price from the given page
price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in price_tags:
    price=i.text
    Price.append(price)

In [236]:
print(len(Brand),len(ProductDescription),len(Price))

120 120 120

In [237]:
import pandas as pd
df=pd.DataFrame({'brand':Brand,'product_description':ProductDescription,'price':Price})
df

             brand                                product_description   price
0    VINCENT CHASE  by Lenskart UV Protection Wayfarer Sunglasses ...    ₹499
1         Fastrack   UV Protection Rectangular Sunglasses (Free Size)    ₹539
2         Fastrack        UV Protection Shield Sunglasses (Free Size)    ₹619
3         Fastrack  Gradient, UV Protection Wayfarer Sunglasses (F...    ₹549
4    VINCENT CHASE  by Lenskart Polarized, UV Protection Aviator S...    ₹556
..             ...                                                ...     ...
115  VINCENT CHASE  by Lenskart UV Protection Retro Square Sunglas...    ₹569
116  VINCENT CHASE  by Lenskart Polarized, UV Protection Cat-eye S...    ₹816
117  VINCENT CHASE  by Lenskart Polarized, UV Protection Round Sun...    ₹816
118  VINCENT CHASE  by Lenskart Polarized, UV Protection Clubmaste...    ₹811
119        Ray-Ban                     UV Protection Round Sunglasses  ₹4,188

[120 rows x 3 columns]

# Q5: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link:
# https://www.flipkart.com/apple-iphone-11-black-64-gb/productreviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART
# As shown in the above page you have to scrape the tick marked attributes. These are:
# 1. Rating
# 2. Review summary
# 3. Full review
# 4. You have to scrape this data for first 100reviews.
# Note: All the steps required during scraping should be done through code only and not manually

In [255]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [256]:
driver=webdriver.Chrome()

In [257]:
driver.get("https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&market")

In [264]:
Rating=[]
Review_summary=[]
Full_review=[]

In [283]:
# scraping brand title from the given page
rating_tags=driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
for i in rating_tags:
    rates=i.text
    Rating.append(rates)
    
# scraping productdescription from the given page
review_summary_tags=driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
for i in review_summary_tags:
    review=i.text
    Review_summary.append(review)
    
# scraping price from the given page
full_review_tags=driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
for i in full_review_tags:
    full_review=i.text
    Full_review.append(full_review)

In [284]:
print(len(Rating),len(Review_summary),len(Full_review))

100 100 100

In [287]:
import pandas as pd
df=pd.DataFrame({'rating':Rating,'review_summary':Review_summary,'full_review':full_review})
df

   rating       review_summary                         full_review
0       5     Perfect product!  Outstanding performance this phone
1       5            Wonderful  Outstanding performance this phone
2       5             Terrific  Outstanding performance this phone
3       5       Classy product  Outstanding performance this phone
4       5  Best in the market!  Outstanding performance this phone
..    ...                  ...                                 ...
95      5   Highly recommended  Outstanding performance this phone
96      5            Wonderful  Outstanding performance this phone
97      4            Very Good  Outstanding performance this phone
98      5            Brilliant  Outstanding performance this phone
99      5       Classy product  Outstanding performance this phone

[100 rows x 3 columns]

# Q6: Scrape data forfirst 100 sneakers you find whenyou visit flipkart.com and search for “sneakers” inthe
# search field.
# You have to scrape 3 attributes of each sneaker:
# 1. Brand
# 2. ProductDescription
# 3. Price
# As shown in the below image, you have to scrape the above attributes.

In [289]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [294]:
driver=webdriver.Chrome()

In [295]:
# opening the shine page on automated chrome browser
driver.get("https://www.flipkart.com/")

In [296]:
sneakers=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/div/input")
sneakers.send_keys('sneakers')

In [297]:
search=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/button")
search.click()

In [313]:
Brand=[]
ProductDescription=[]
Price=[]

In [324]:
# scraping brand title from the given page
brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brand_tags:
    titles=i.text
    Brand.append(titles)
    
# scraping productdescription from the given page
ProductDescription_tags=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
for i in ProductDescription_tags:
    product=i.text
    ProductDescription.append(product)
    
# scraping price from the given page
price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in price_tags:
    price=i.text
    Price.append(price)

In [325]:
print(len(Brand),len(ProductDescription),len(Price))

100 100 100

In [326]:
import pandas as pd
df=pd.DataFrame({'brand':Brand,'product_description':ProductDescription,'price':Price})
df

    brand                     product_description   price
0    PUMA      Suede Classic XXI Sneakers For Men  ₹2,799
1    PUMA      Suede Classic XXI Sneakers For Men  ₹3,899
2    PUMA     Court Star Vulc FS Sneakers For Men  ₹2,399
3    PUMA                Rs-z Bp Sneakers For Men  ₹4,213
4    PUMA          Twitch Runner Sneakers For Men  ₹3,999
..    ...                                     ...     ...
95   PUMA    Rebound Street v2 L Sneakers For Men  ₹2,399
96   PUMA            RS-X Master Sneakers For Men  ₹5,399
97   PUMA  Cell Venom Alert Running Shoes For Men  ₹5,999
98  Arbok            Arbok Trendy Casuals For Men    ₹490
99  Arbok            Arbok Trendy Casuals For Men    ₹490

[100 rows x 3 columns]

# Q7: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then set CPU Type filter to “Intel Core i7” as shown in the below image:
# After setting the filters scrape first 10 laptops data. You have to scrape 3 attributes for each laptop:
# 1. Title
# 2. Ratings
# 3. Price

In [112]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [116]:
driver=webdriver.Chrome()

In [117]:
# opening the shine page on automated chrome browser
driver.get("https://www.amazon.in/?&tag=googhydrabk1-21&ref=pd_sl_7hz2t19t5c_e&adgrpid=155259815513&hvpone=&hvptwo=&hvadid=674842289437&hvpos=&hvnetw=g&hvrand=12753365725127441909&hvqmt=e&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9062122&hvtargid=kwd-10573980&hydadcr=14453_2316415&gad_source=1")

In [118]:
product_name=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input")
product_name.send_keys('laptop')

In [119]:
search=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input")
search.click()

In [122]:
Title_=[]
Ratings_=[]
Price_=[]

In [123]:
# scraping brand title from the given page
title_tags=driver.find_elements(By.XPATH,'//span[@class="a-size-medium a-color-base a-text-normal"]')
for i in title_tags:
    titles=i.text
    Title_.append(titles)
# scraping rating from the given page
rating_tag=driver.find_elements(By.XPATH,'//a[@class="a-popover-trigger a-declarative"]')
for i in rating_tag:
    rate=i.text
    Ratings_.append(rate)
    
# scraping price from the given page
price_tag=driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in price_tag:
    price=i.text
    Price_.append(price)

In [126]:
print(len(Title_),len(Price_))

24 24

In [128]:
import pandas as pd
df=pd.DataFrame({'title':Title_,'(rs)price':Price_})
df

                                                title (rs)price
0   ASUS TUF Gaming F15, 15.6"(39.62 cms) FHD 144H...    73,990
1   MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...    54,820
2   Lenovo IdeaPad Slim 3 Intel Core i7 12th Gen 1...    62,032
3   ASUS Vivobook 16X, Intel Core i7-12650H 12th G...  1,04,990
4   Lenovo IdeaPad Slim 5 Intel Core i7 13700H 16"...    87,190
5   ASUS Vivobook 15, Intel Core i7-12650H 12th Ge...    64,990
6   MSI Modern 15, Intel 13th Gen. i7-1355U, 40CM ...    65,990
7   HP Pavilion X360 11th Gen Intel Core i7 14" (3...    77,990
8   GIGABYTE G5 MF-G2IN313SH Gaming Laptop Intel C...    75,990
9   HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...    67,490
10  HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...    77,590
11  Dell Inspiron 3530 Laptop, Intel Core i7-1355U...    71,490
12  Dell Alienware x14 R2 Gaming Laptop, Intel Cor...  2,25,990
13  MSI Pulse 15, Intel 13th Gen. i7-13700H, 40CM ...  1,29,990
14  Samsung Galaxy Book3 Core i7 13th Gen 1355U - ...    86,990
15  HP OMEN Gaming Laptop, Intel Core i7-14700HX (...  1,50,990
16  ASUS Vivobook S 15 OLED (2023), Intel Core EVO...  1,02,481
17  HP Victus 12th Gen Intel Core i7 15.6 inch(39....    82,777
18  ASUS Vivobook S15 OLED 2022, 15.6" 39.62 cms F...    78,060
19  HP Pavilion 14, 11th Gen Intel Core i7-1195G7,...    72,100
20  HP Envy x360 12th Gen Intel Core i7-13.3 inch(...  1,14,990
21  Dell G16-7630 Gaming 13th Gen Laptop, Intel i7...  1,66,490
22  HP Victus Gaming Laptop 12th Gen Intel Core i7...    97,990
23  Microsoft New Surface Laptop5 15" Intel evo 12...  1,82,990

# Q8: Write a python program to scrape data for Top 1000 Quotes of All Time.
# The above task will be done in following steps:
# 1. First get the webpagehttps://www.azquotes.com/
# 2. Click on TopQuotes
# 3. Than scrap a) Quote b) Author c) Type Of Quotes

In [36]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [38]:
driver=webdriver.Chrome()

In [39]:
# opening the azquotes page on automated chrome browser
driver.get("https://www.azquotes.com/")

In [40]:
search=driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a")
search.click()

In [41]:
Quote=[]
Author=[] 
Type_Of_Quotes=[]

In [62]:
# scraping quote  from the given page
quote_tags=driver.find_elements(By.XPATH,'//a[@class="title"]')
for i in quote_tags:
    titles=i.text
    Quote.append(titles)
# scraping author from the given page
author_tag=driver.find_elements(By.XPATH,'//div[@class="author"]')
for i in author_tag:
    tag=i.text
    Author.append(tag)
    
# scraping type of quote from the given page
type_tag=driver.find_elements(By.XPATH,'//div[@class="tags"]')
for i in type_tag:
    quote=i.text
    Type_Of_Quotes.append(quote)

In [63]:
print(len(Quote),len(Author),len(Type_Of_Quotes))

1000 1000 1000

In [64]:
import pandas as pd
df=pd.DataFrame({'quote':Quote,'author':Author,'type_of_quotes':Type_Of_Quotes})
df

,quote,author,type_of_quotes
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
995,Regret for the things we did can be tempered b...,Sydney J. Harris,"Love, Inspirational, Motivational"
996,America... just a nation of two hundred millio...,Hunter S. Thompson,"Gun, Two, Qualms About"
997,For every disciplined effort there is a multip...,Jim Rohn,"Inspirational, Greatness, Best Effort"
998,"The spiritual journey is individual, highly pe...",Ram Dass,"Spiritual, Truth, Yoga"
999,The mind is not a vessel to be filled but a fi...,Plutarch,"Inspirational, Leadership, Education"

# Q9: Write a python program to display list of respected former Prime Ministers of India(i.e. Name, Born-Dead, Term of office, Remarks) from https://www.jagranjosh.com/.
# This task will be done in following steps:
# 1. First get the webpagehttps://www.jagranjosh.com/
# 2. Then You have to click on the GK option
# 3. Then click on the List of all Prime Ministers of India
# 4. Then scrap the mentioned data and make theDataFrame

In [65]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [66]:
driver=webdriver.Chrome()

In [67]:
# opening the jagranjosh page on automated chrome browser
driver.get("https://www.jagranjosh.com/")

In [68]:
search=driver.find_element(By.XPATH,"/html/body/div[1]/header/nav/div/div/div[3]/ul/li[3]/a")
search.click()

In [69]:
search=driver.find_element(By.XPATH,"/html/body/div[1]/div[8]/section[17]/div/div/ul[2]/li[11]/a")
search.click()

In [73]:
Name=[]

In [ ]:
#this code are not going to work because there is no seperate among the row and column code
# scraping name  from the given page
name_tags=driver.find_elements(By.XPATH,'')
for i in name_tags:
    titles=i.text
    Name.append(titles)
# scraping born_dead from the given page
born_dead_tag=driver.find_elements(By.XPATH,'')
for i in born_dead_tag:
    tag=i.text
    Born_Dead.append(tag)
    
# scraping term_of_office from the given page
term_of_office_tag=driver.find_elements(By.XPATH,'')
for i in term_of_office_tag:
    office=i.text
    Term_of_office.append(office)
# scraping remark from the given page    
remark_tag=driver.find_elements(By.XPATH,'')
for i in remark_tag:
    remark=i.text
    Remarks.append(remark)

In [75]:
# scraping name  from the given page
name_tags=driver.find_elements(By.XPATH,'//td[@valign="top"]')
for i in name_tags:
    titles=i.text
    Name.append(titles)

In [76]:
print(len(Name))

85

In [77]:
import pandas as pd
df=pd.DataFrame({'name':Name})
df

                                                 name
0                                                  1.
1                                   Jawahar Lal Nehru
2                                         (1889–1964)
3   15 August 1947 to 27 May 1964\n16 years, 286 days
4   The first prime minister of India and the long...
..                                                ...
80                                                18.
81                                      Narendra Modi
82                                        (born 1950)
83                                 26 May 2014 - 2019
84  4th Prime Minister of India who served two con...

[85 rows x 1 columns]

# Q10: Write a python program to display list of 50 Most expensive cars in the world (i.e. Car name and Price) from https://www.motor1.com/
# This task will be done in following steps:
# 1. First get the webpage https://www.motor1.com/
# 2. Then You have to type in the search bar ’50 most expensive cars’
# 3. Then click on 50 most expensive carsin the world..
# 4. Then scrap the mentioned data and make the dataframe.

In [87]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [88]:
driver=webdriver.Chrome()

In [89]:
# opening the motor car page on automated chrome browser
driver.get("https://www.motor1.com/")

In [90]:
expensive_car=driver.find_element(By.XPATH,"/html/body/div[10]/div[2]/div/div/div[3]/div/div/div/form/input")
expensive_car.send_keys('50 most expensive cars')

In [92]:
search=driver.find_element(By.XPATH,"/html/body/div[10]/div[2]/div/div/div[3]/div/div/div/form/button[1]")
search.click()

In [93]:
search=driver.find_element(By.XPATH,"/html/body/div[10]/div[9]/div/div[1]/div/div/div[2]/div/div[1]/h3/a")
search.click()

In [108]:
Car_name=[]  
Price=[]

In [109]:
car_name=driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
for i in car_name:
    titles=i.text
    Car_name.append(titles)




price_tag=driver.find_elements(By.XPATH,'//p[strong]')
for i in price_tag:
    price=i.text
    Price.append(price)

In [110]:
print(len(Car_name),len(Price))

50 50

In [111]:
import pandas as pd
df=pd.DataFrame({'car_name':Car_name,'price':Price})
df

                              car_name                        price
0                  Aston Martin Valour          Price: $1.5 Million
1                         McLaren Elva          Price: $1.7 Million
2                          Czinger 21C          Price: $1.7 Million
3                        Ferrari Monza          Price: $1.7 Million
4                   Gordon Murray T.33          Price: $1.7 Million
5                    Koenigsegg Gemera          Price: $1.7 Million
6                          Zenvo TSR-S          Price: $1.7 Million
7                   Hennessey Venom F5          Price: $1.8 Million
8                      Bentley Bacalar          Price: $1.9 Million
9        Hispano Suiza Carmen Boulogne          Price: $1.9 Million
10              Bentley Mulliner Batur          Price: $2.0 Million
11                        Deus Vayanne          Price: $2.0 Million
12                         SSC Tuatara          Price: $2.0 Million
13                         Lotus Evija          Price: $2.1 Million
14                 Aston Martin Vulcan          Price: $2.3 Million
15                          Delage D12          Price: $2.3 Million
16                 Ferrari Daytona SP3          Price: $2.3 Million
17                   McLaren Speedtail          Price: $2.3 Million
18                        Rimac Nevera          Price: $2.4 Million
19                       Pagani Utopia          Price: $2.5 Million
20                Pininfarina Battista          Price: $2.5 Million
21                  Gordon Murray T.50          Price: $2.6 Million
22                Lamborghini Countach          Price: $2.6 Million
23            Mercedes-AMG Project One          Price: $2.7 Million
24                        Zenvo Aurora          Price: $2.8 Million
25                 Aston Martin Victor          Price: $3.0 Million
26         Hennessey Venom F5 Roadster                 $3.0 Million
27                    Koenigsegg Jesko          Price: $3.0 Million
28               Aston Martin Valkyrie          Price: $3.2 Million
29           W Motors Lykan Hypersport          Price: $3.4 Million
30                       McLaren Solus                 $3.5 Million
31                    Lamborghini Sian          Price: $3.6 million
32                    Koenigsegg CC850          Price: $3.7 Million
33     Bugatti Chiron Super Sport 300+          Price: $3.9 Million
34                  Lamborghini Veneno          Price: $4.5 Million
35                      Bugatti Bolide          Price: $4.7 Million
36           Pininfarina B95 Speedster          Price: $4.8 Million
37                     Bugatti Mistral          Price: $5.0 Million
38                 Pagani Huayra Imola          Price: $5.4 Million
39                        Bugatti Divo          Price: $5.8 Million
40                 SP Automotive Chaos          Price: $6.4 Million
41                    Pagani Codalunga          Price: $7.4 Million
42                        777 Hypercar          Price: $7.5 Million
43            Mercedes-Maybach Exelero          Price: $8.0 Million
44                  Bugatti Centodieci          Price: $9.0 Million
45             Bugatti Chiron Profilée         Price: $10.8 Million
46                Rolls-Royce Sweptail         Price: $12.8 Million
47            Bugatti La Voiture Noire         Price: $13.4 Million
48              Rolls-Royce Boat Tail*  Price: $28.0 Million (est.)
49  Rolls-Royce La Rose Noire Droptail    Price: $30 Million (est.)